In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib as mpl
from pandas.plotting import scatter_matrix
import seaborn as sns
sns.set(style="ticks", color_codes=True)

%matplotlib inline



mpl.rcParams['axes.unicode_minus'] = False

In [5]:
df = pd.read_excel('Data_Sets.xlsx', 'Facebook')

In [7]:
df1=df

In [10]:
df1.head()

  FACEBOOK SURVEY DATA Unnamed: 1         Unnamed: 2 Unnamed: 3
0                  NaN        NaN                NaN        NaN
1              Student     Gender  Hours online/week    Friends
2                    1     female                  4        150
3                    2     female                 10        400
4                    5     female                  9        260

In [11]:
df1 = df1.shift(-1)

In [13]:
df1.head()

  FACEBOOK SURVEY DATA Unnamed: 1         Unnamed: 2 Unnamed: 3
0              Student     Gender  Hours online/week    Friends
1                    1     female                  4        150
2                    2     female                 10        400
3                    5     female                  9        260
4                    6     female                  5         70

In [18]:
new_col_names = pd.Series(df1.iloc[0])

In [19]:
new_col_names

FACEBOOK SURVEY DATA              Student
Unnamed: 1                         Gender
Unnamed: 2              Hours online/week
Unnamed: 3                        Friends
Name: 0, dtype: object

In [20]:
df1.columns=list(new_col_names)

In [22]:
df1=df1.drop(df1.index[0])

In [28]:
df1=df1.drop(df1.index[33])

In [29]:
df1

   Student  Gender Hours online/week Friends
1        1  female                 4     150
2        2  female                10     400
3        5  female                 9     260
4        6  female                 5      70
5        7  female                 7      90
6        9  female                12     110
7       10  female                 2      30
8       11  female                 6      80
9       12  female                 2      30
10      14  female                 6     240
11      17  female                 8     340
12      19  female                 4      50
13      22  female                 4     280
14      23  female                 5      60
15      24  female                 9     100
16      25  female                12     380
17      27  female                 2      80
18      28  female                 7     170
19      31  female                 2      50
20      33  female                 7     170
21       3    male                 7     120
22       4    male                15     500
23       8    male                 5     250
24      13    male                 3     200
25      15    male                 6     150
26      16    male                 4      90
27      18    male                10     450
28      20    male                 4     120
29      21    male                 6     180
30      26    male                 8     430
31      29    male                 6      90
32      30    male                 4      50
33      32    male                 5      70